In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_1_.csv')
df.head(5)

,시도명,시군구명,종량제봉투종류,종량제봉투처리방식,종량제봉투용도,종량제봉투사용대상,1L가격,1.5L가격,2L가격,2.5L가격,...,60L가격,75L가격,100L가격,120L가격,125L가격,관리부서명,관리부서전화번호,데이터기준일자,제공기관코드,제공기관명
0,경기도,안양시,규격봉투,매립용,생활쓰레기,사업장용,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
1,경기도,안양시,규격봉투,매립용,생활쓰레기,기타,0,0,0,0,...,0,2100,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
2,경기도,안양시,규격봉투,소각용,음식물쓰레기,가정용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
3,경기도,안양시,규격봉투,소각용,음식물쓰레기,사업장용,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시
4,경기도,안양시,규격봉투,소각용,음식물쓰레기,기타,0,50,0,80,...,0,0,0,0,0,자원순환과,031-8045-5448,2022-08-12,3830000,경기도 안양시

### 1-1
20L가격과 5L가격이 모두 0원이 아닌 데이터만 필터를 한 후,

각 row별로 20L가격과 5L가격의 차이를 ‘차이가격’ 이라 부른다고 하자. 

시도명 별 차이가격의 평균가격을 비교할때 

그 값이 가장 큰 금액을 반올림하여 

소숫점 이하 1자리까지 구하여라

In [11]:
df_tmp = df[(df['20L가격']!=0) & (df['5L가격'] !=0)]
df_tmp['차이가격'] = df['20L가격'] - df['5L가격']

C:\Users\sujung\AppData\Local\Temp\ipykernel_17912\1791277862.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_tmp['차이가격'] = df['20L가격'] - df['5L가격']

In [30]:
df_tmp.groupby(by=['시도명'])['차이가격'].mean().sort_values(ascending=False).round(1).max()

619.0

In [3]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_2_.csv')
df.head(5)

       ID  height(cm)  weight(kg)
0  user_1       173.0        67.5
1  user_2       149.5        82.5
2  user_3       143.8        64.6
3  user_4       163.1        87.2
4  user_5       159.6        77.1

#### 1-2

BMI는 몸무게(kg) / (키(M) * 키(M)) 로 정의 된다.

초고도 비만은 BMI 25이상 , 

고도 비반은 BMI 25미만 - 23이상 , 

정상은 23미만 - 18.5이상

저체중은 18.5미만으로 정의 된다. 

주어진 데이터에서 초고도비만 인원 + 저체중 인원 의 숫자는?

In [4]:
df.isna().sum()

ID            0
height(cm)    0
weight(kg)    0
dtype: int64

In [5]:
df['BMI'] = df['weight(kg)'] / (df['height(cm)'] / 100) ** 2

In [7]:
df.head()

       ID  height(cm)  weight(kg)        BMI
0  user_1       173.0        67.5  22.553376
1  user_2       149.5        82.5  36.912339
2  user_3       143.8        64.6  31.240268
3  user_4       163.1        87.2  32.779971
4  user_5       159.6        77.1  30.268340

In [13]:
len(df[df.BMI >= 25]), len(df[df.BMI < 18.5])

(8978, 20)

In [14]:
len(df[df.BMI >= 25]) + len(df[df.BMI < 18.5])

8998

### 년도별 서울 각 구의 초,중,고 전출 전입 인원 :

In [15]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p1_3.csv')
df.head(5)

,지역,초등학교_전출_도내,초등학교_전출_도외,초등학교_전입_도내,초등학교_전입_도외,중학교_전출_도내,중학교_전출_도외,중학교_전입_도내,중학교_전입_도외,고등학교_전출_도내,고등학교_전출_도외,고등학교_전입_도내,고등학교_전입_도외,년도
0,종로구,221,132,255,126,63,71,104,73,203,72,166,75,2012
1,중구,295,139,203,100,66,43,58,44,156,37,104,39,2012
2,용산구,380,269,302,174,134,78,91,106,102,66,113,48,2012
3,성동구,643,344,376,221,154,103,98,82,179,37,153,41,2012
4,광진구,560,382,595,312,165,158,158,118,115,70,154,66,2012

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 250 entries, 0 to 249
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   지역          250 non-null    object
 1   초등학교_전출_도내  250 non-null    int64
 2   초등학교_전출_도외  250 non-null    int64
 3   초등학교_전입_도내  250 non-null    int64
 4   초등학교_전입_도외  250 non-null    int64
 5   중학교_전출_도내   250 non-null    int64
 6   중학교_전출_도외   250 non-null    int64
 7   중학교_전입_도내   250 non-null    int64
 8   중학교_전입_도외   250 non-null    int64
 9   고등학교_전출_도내  250 non-null    int64
 10  고등학교_전출_도외  250 non-null    int64
 11  고등학교_전입_도내  250 non-null    int64
 12  고등학교_전입_도외  250 non-null    int64
 13  년도          250 non-null    int64
dtypes: int64(13), object(1)
memory usage: 27.5+ KB

In [17]:
df.isna().sum()

지역            0
초등학교_전출_도내    0
초등학교_전출_도외    0
초등학교_전입_도내    0
초등학교_전입_도외    0
중학교_전출_도내     0
중학교_전출_도외     0
중학교_전입_도내     0
중학교_전입_도외     0
고등학교_전출_도내    0
고등학교_전출_도외    0
고등학교_전입_도내    0
고등학교_전입_도외    0
년도            0
dtype: int64

In [18]:
df.년도.unique()

array([2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020, 2021],
      dtype=int64)

In [36]:
# 순유입인원은 초중고 도내,도외 전입인원에서 
# 초중고 도내, 도외 전출인원을 뺀값이다. 
# 각년도별로 가장 큰 순유입인원을 가진 
# 지역구의 순유입인원을 구하고
# 전체 기간의 해당 순유입인원들의 합을 구하여라
df['순유입인원'] = df[[x for x in df.columns if '전입' in x]].sum(axis=1) \
                 - df[[x for x in df.columns if '전출' in x]].sum(axis=1)

In [43]:
df.sort_values(['년도', '순유입인원'], ascending=False).groupby('년도').head(1).순유입인원.sum()

13853

In [46]:
df.groupby('년도')['순유입인원'].max().sum()

13853

### 벤츠 차량 가격 예측

In [90]:
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p2_train_.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p2_test_.csv')

In [91]:
train.shape, test.shape

((9823, 10), (3296, 9))

In [92]:
train.head()

,ID,model,year,price,transmission,mileage,fuelType,tax,mpg,engineSize
0,10170,A Class,2012,11940,Automatic,46000,Diesel,30,64.2,2.1
1,9551,CL Class,2020,38624,Semi-Auto,19,Petrol,150,36.7,2.0
2,1790,A Class,2013,8500,Manual,69031,Petrol,125,51.4,1.6
3,10018,B Class,2015,13998,Automatic,34739,Diesel,125,56.5,2.1
4,142,E Class,2017,20998,Semi-Auto,21352,Diesel,20,72.4,2.0

In [93]:
test.head()

   ID       model  year transmission  mileage fuelType  tax   mpg  engineSize
0   0         SLK  2005    Automatic    63000   Petrol  325  32.1         1.8
1   2    SL CLASS  2016    Automatic     6200   Petrol  555  28.0         5.5
2  14   GLA Class  2016    Automatic    41713   Diesel  125  56.6         2.1
3  15     B Class  2017    Automatic    24841   Diesel  150  68.9         1.5
4  18     B Class  2017    Automatic    14128   Diesel  150  68.9         2.1

In [94]:
set(test.model.unique()) - set(train.model.unique())

{'220'}

In [95]:
test.model.unique(), train.model.unique()

(array([' SLK', ' SL CLASS', ' GLA Class', ' B Class', ' C Class',
        ' E Class', ' GLC Class', ' CLS Class', ' A Class', ' M Class',
        ' S Class', ' CL Class', ' GLS Class', ' G Class', ' V Class',
        ' GL Class', ' GLE Class', ' GLB Class', ' X-CLASS', ' CLA Class',
        ' CLK', '220'], dtype=object),
 array([' A Class', ' CL Class', ' B Class', ' E Class', ' GLE Class',
        ' C Class', ' GLC Class', ' GLA Class', ' SLK', ' SL CLASS',
        ' V Class', ' CLS Class', ' X-CLASS', ' M Class', ' GL Class',
        ' CLA Class', ' G Class', ' S Class', ' GLS Class', ' CLK',
        ' GLB Class', ' CLC Class', '230', '180', ' R Class', '200'],
       dtype=object))

In [96]:
drop_col = ['ID', 'price']
train_drop = train.drop(columns=drop_col)
test_drop = test.drop(columns=['ID'])
y = train['price']

In [97]:
train_drop.head()

       model  year transmission  mileage fuelType  tax   mpg  engineSize
0    A Class  2012    Automatic    46000   Diesel   30  64.2         2.1
1   CL Class  2020    Semi-Auto       19   Petrol  150  36.7         2.0
2    A Class  2013       Manual    69031   Petrol  125  51.4         1.6
3    B Class  2015    Automatic    34739   Diesel  125  56.5         2.1
4    E Class  2017    Semi-Auto    21352   Diesel   20  72.4         2.0

In [98]:
test_drop.head()

        model  year transmission  mileage fuelType  tax   mpg  engineSize
0         SLK  2005    Automatic    63000   Petrol  325  32.1         1.8
1    SL CLASS  2016    Automatic     6200   Petrol  555  28.0         5.5
2   GLA Class  2016    Automatic    41713   Diesel  125  56.6         2.1
3     B Class  2017    Automatic    24841   Diesel  150  68.9         1.5
4     B Class  2017    Automatic    14128   Diesel  150  68.9         2.1

In [99]:
train_dummies = pd.get_dummies(train_drop)
test_dummies = pd.get_dummies(test_drop)

In [100]:
train_dummies.shape, test_dummies.shape

((9823, 39), (3296, 33))

In [101]:
train_dummies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9823 entries, 0 to 9822
Data columns (total 39 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   year                    9823 non-null   int64
 1   mileage                 9823 non-null   int64
 2   tax                     9823 non-null   int64
 3   mpg                     9823 non-null   float64
 4   engineSize              9823 non-null   float64
 5   model_ A Class          9823 non-null   uint8
 6   model_ B Class          9823 non-null   uint8
 7   model_ C Class          9823 non-null   uint8
 8   model_ CL Class         9823 non-null   uint8
 9   model_ CLA Class        9823 non-null   uint8
 10  model_ CLC Class        9823 non-null   uint8
 11  model_ CLK              9823 non-null   uint8
 12  model_ CLS Class        9823 non-null   uint8
 13  model_ E Class          9823 non-null   uint8
 14  model_ G Class          9823 non-null   uint8
 15  model_ GL Class         9823 non-null   uint8
 16  model_ GLA Class        9823 non-null   uint8
 17  model_ GLB Class        9823 non-null   uint8
 18  model_ GLC Class        9823 non-null   uint8
 19  model_ GLE Class        9823 non-null   uint8
 20  model_ GLS Class        9823 non-null   uint8
 21  model_ M Class          9823 non-null   uint8
 22  model_ R Class          9823 non-null   uint8
 23  model_ S Class          9823 non-null   uint8
 24  model_ SL CLASS         9823 non-null   uint8
 25  model_ SLK              9823 non-null   uint8
 26  model_ V Class          9823 non-null   uint8
 27  model_ X-CLASS          9823 non-null   uint8
 28  model_180               9823 non-null   uint8
 29  model_200               9823 non-null   uint8
 30  model_230               9823 non-null   uint8
 31  transmission_Automatic  9823 non-null   uint8
 32  transmission_Manual     9823 non-null   uint8
 33  transmission_Other      9823 non-null   uint8
 34  transmission_Semi-Auto  9823 non-null   uint8
 35  fuelType_Diesel         9823 non-null   uint8
 36  fuelType_Hybrid         9823 non-null   uint8
 37  fuelType_Other          9823 non-null   uint8
 38  fuelType_Petrol         9823 non-null   uint8
dtypes: float64(2), int64(3), uint8(34)
memory usage: 710.0 KB

In [102]:
test_dummies.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3296 entries, 0 to 3295
Data columns (total 33 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   year                    3296 non-null   int64
 1   mileage                 3296 non-null   int64
 2   tax                     3296 non-null   int64
 3   mpg                     3296 non-null   float64
 4   engineSize              3296 non-null   float64
 5   model_ A Class          3296 non-null   uint8
 6   model_ B Class          3296 non-null   uint8
 7   model_ C Class          3296 non-null   uint8
 8   model_ CL Class         3296 non-null   uint8
 9   model_ CLA Class        3296 non-null   uint8
 10  model_ CLK              3296 non-null   uint8
 11  model_ CLS Class        3296 non-null   uint8
 12  model_ E Class          3296 non-null   uint8
 13  model_ G Class          3296 non-null   uint8
 14  model_ GL Class         3296 non-null   uint8
 15  model_ GLA Class        3296 non-null   uint8
 16  model_ GLB Class        3296 non-null   uint8
 17  model_ GLC Class        3296 non-null   uint8
 18  model_ GLE Class        3296 non-null   uint8
 19  model_ GLS Class        3296 non-null   uint8
 20  model_ M Class          3296 non-null   uint8
 21  model_ S Class          3296 non-null   uint8
 22  model_ SL CLASS         3296 non-null   uint8
 23  model_ SLK              3296 non-null   uint8
 24  model_ V Class          3296 non-null   uint8
 25  model_ X-CLASS          3296 non-null   uint8
 26  model_220               3296 non-null   uint8
 27  transmission_Automatic  3296 non-null   uint8
 28  transmission_Manual     3296 non-null   uint8
 29  transmission_Semi-Auto  3296 non-null   uint8
 30  fuelType_Diesel         3296 non-null   uint8
 31  fuelType_Hybrid         3296 non-null   uint8
 32  fuelType_Petrol         3296 non-null   uint8
dtypes: float64(2), int64(3), uint8(28)
memory usage: 219.0 KB

In [103]:
test_dummies = test_dummies.reindex(columns=train_dummies.columns, fill_value=0)
test_dummies

,year,mileage,tax,mpg,engineSize,model_ A Class,model_ B Class,model_ C Class,model_ CL Class,model_ CLA Class,...,model_200,model_230,transmission_Automatic,transmission_Manual,transmission_Other,transmission_Semi-Auto,fuelType_Diesel,fuelType_Hybrid,fuelType_Other,fuelType_Petrol
0,2005,63000,325,32.1,1.8,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1
1,2016,6200,555,28.0,5.5,0,0,0,0,0,...,0,0,1,0,0,0,0,0,0,1
2,2016,41713,125,56.6,2.1,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,0
3,2017,24841,150,68.9,1.5,0,1,0,0,0,...,0,0,1,0,0,0,1,0,0,0
4,2017,14128,150,68.9,2.1,0,1,0,0,0,...,0,0,1,0,0,0,1,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3291,2016,27804,260,42.8,3.0,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,0
3292,2019,10635,145,44.1,1.5,0,0,1,0,0,...,0,0,1,0,0,0,0,0,0,1
3293,2016,14000,125,56.5,2.1,0,0,0,0,0,...,0,0,1,0,0,0,1,0,0,0
3294,2017,20477,145,68.9,2.1,1,0,0,0,0,...,0,0,1,0,0,0,1,0,0,0
3295,2019,5000,145,61.4,2.0,0,0,1,0,0,...,0,0,1,0,0,0,1,0,0,0

In [104]:
train_dummies.shape, test_dummies.shape

((9823, 39), (3296, 39))

In [105]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import mean_squared_error

In [106]:
X_train, X_test, y_train, y_test = train_test_split(train_dummies, y, test_size=0.33, random_state=2023)

In [107]:
rfr = RandomForestRegressor(random_state=2023)
rfr.fit(X_train, y_train)

RandomForestRegressor(random_state=2023)

In [108]:
X_train_pd = rfr.predict(X_train)
X_test_pd = rfr.predict(X_test)
test_dummies_pd = rfr.predict(test_dummies)

In [111]:
import numpy as np

np.sqrt(mean_squared_error(y_test, X_test_pd))

2444.1575258537346

In [110]:
test_dummies_pd

array([ 4037.59      , 67226.26      , 17126.76      , ...,
       23947.24      , 16826.23      , 29164.24833333])

In [89]:
df = pd.DataFrame({'ID':test.ID, 'price': test_dummies_pd })
df

         ID         price
0         0   4037.590000
1         2  67226.260000
2        14  17126.760000
3        15  14168.350000
4        18  16105.460000
...     ...           ...
3291  13096  27703.590000
3292  13098  24222.700000
3293  13101  23947.240000
3294  13109  16826.230000
3295  13112  29164.248333

[3296 rows x 2 columns]

### 작업 3유형

#### 어느 학교에서 추출한 55명 학생들의 키 정보이다.

In [3]:
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_1.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      55 non-null     object
 1   height  55 non-null     float64
dtypes: float64(1), object(1)
memory usage: 1008.0+ bytes

In [4]:
df.isna().sum()

ID        0
height    0
dtype: int64

In [5]:
df.head()

       ID  height
0  user_1  164.57
1  user_2  174.99
2  user_3  171.41
3  user_4  162.47
4  user_5  167.11

In [16]:
# 55명 학생들의 키에 대한 표본 평균을 구하여라(반올림하여 소숫점 3째자리까지
mn = round(df.height.mean(), 3)
print(mn)

169.937

In [7]:
# t분포 양쪽 꼬리에서의 t 값을 구하여라 (반올림하여 소수4째자리까지)
from scipy.stats import t

dir(t)

['__call__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__getstate__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__setstate__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_argcheck',
 '_argcheck_rvs',
 '_attach_argparser_methods',
 '_attach_methods',
 '_cdf',
 '_cdf_single',
 '_cdfvec',
 '_construct_argparser',
 '_construct_default_doc',
 '_construct_doc',
 '_ctor_param',
 '_entropy',
 '_fit_loc_scale_support',
 '_fitstart',
 '_get_support',
 '_isf',
 '_logcdf',
 '_logpdf',
 '_logpxf',
 '_logsf',
 '_mom0_sc',
 '_mom1_sc',
 '_mom_integ0',
 '_mom_integ1',
 '_moment_error',
 '_munp',
 '_nnlf',
 '_nnlf_and_penalty',
 '_open_support_mask',
 '_param_info',
 '_parse_arg_template',
 '_parse_args',
 '_parse_args_rvs',
 '_parse_args_stats',
 '_pdf',
 '_penalized_nnlf',
 '_ppf',
 '_ppf_single',
 '_ppf_to_solve',
 '_ppfvec',
 '_random_state',
 '_reduce_func',
 '_rvs',
 '_sf',
 '_shape_info',
 '_stats',
 '_stats_has_moments',
 '_support_mask',
 '_unpack_loc_scale',
 '_updated_ctor_param',
 'a',
 'b',
 'badvalue',
 'cdf',
 'entropy',
 'expect',
 'extradoc',
 'fit',
 'fit_loc_scale',
 'freeze',
 'generic_moment',
 'interval',
 'isf',
 'logcdf',
 'logpdf',
 'logsf',
 'mean',
 'median',
 'moment',
 'moment_type',
 'name',
 'nnlf',
 'numargs',
 'pdf',
 'ppf',
 'random_state',
 'rvs',
 'sf',
 'shapes',
 'stats',
 'std',
 'support',
 'var',
 'vecentropy',
 'xtol']

In [8]:
help(df.height.std)

Help on method std in module pandas.core.generic:

std(axis=None, skipna=True, level=None, ddof=1, numeric_only=None, **kwargs) method of pandas.core.series.Series instance
    Return sample standard deviation over requested axis.

    Normalized by N-1 by default. This can be changed using the ddof argument.

    Parameters
    ----------
    axis : {index (0)}
    skipna : bool, default True
        Exclude NA/null values. If an entire row/column is NA, the result
        will be NA.
    level : int or level name, default None
        If the axis is a MultiIndex (hierarchical), count along a
        particular level, collapsing into a scalar.
    ddof : int, default 1
        Delta Degrees of Freedom. The divisor used in calculations is N - ddof,
        where N represents the number of elements.
    numeric_only : bool, default None
        Include only float, int, boolean columns. If None, will attempt to use
        everything, then use only numeric data. Not implemented for Series.

    Returns
    -------
    scalar or Series (if level specified)

    Notes
    -----
    To have the same behaviour as `numpy.std`, use `ddof=0` (instead of the
    default `ddof=1`)

    Examples
    --------
    >>> df = pd.DataFrame({'person_id': [0, 1, 2, 3],
    ...                   'age': [21, 25, 62, 43],
    ...                   'height': [1.61, 1.87, 1.49, 2.01]}
    ...                  ).set_index('person_id')
    >>> df
               age  height
    person_id
    0           21    1.61
    1           25    1.87
    2           62    1.49
    3           43    2.01

    The standard deviation of the columns can be found as follows:

    >>> df.std()
    age       18.786076
    height     0.237417

    Alternatively, `ddof=0` can be set to normalize by N instead of N-1:

    >>> df.std(ddof=0)
    age       16.269219
    height     0.205609

In [15]:
std = df.height.std(ddof=1)
print(std)
n = len(df.height)
print(n)

5.977625087231691
55

In [14]:
# 신뢰수준, 자유도
confidence_level = 0.95
ddof = n - 1

# t분포 양쪽 꼬리에서의 t값
t_value = round(t.ppf((1+confidence_level)/2, ddof), 4)
print(t_value)

2.0049

In [19]:
# 95% 신뢰구간을 구하여라(print(lower,upper) 방식으로 출력, 각각의 값은 소숫점 이하 3째자리까지)
import numpy as np
lower = round(mn - t_value * std / np.sqrt(n) , 3)
upper = round(mn + t_value * std / np.sqrt(n), 3)
print(lower, upper)

168.321 171.553

### A,B,C 세 공장에서 생산한 동일한 제품의 길이 데이터 이다
### 공장간의 제품 길이 차이가 유의미한지 확인 하려한다.

In [20]:
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e5_p3_2.csv')
df.head()

  ID      value
0  A  84.179434
1  A  93.971003
2  A  62.140957
3  A  72.911723
4  A  79.252747

In [22]:
df.isna().sum()

ID       0
value    0
dtype: int64

In [29]:
df.ID.unique()

array(['A', 'B', 'C'], dtype=object)

In [33]:
# 3 그룹의 데이터에 대해 크루스칼-왈리스 검정을 사용하여 
# 검정 통계량을 반올림하여 소숫점 이하 3자리까지 구하여라
from scipy.stats import kruskal
a = df[df.ID == 'A'].value.values
b = df[df.ID == 'B'].value.values
c = df[df.ID == 'C'].value.values

s, p = kruskal(a, b, c)
round_s = round(s, 3)
print(round_s)

6.521

In [34]:
# 3 그룹의 데이터에 대해 크루스칼-왈리스 검정을 사용하여
# p-value를 반올림하여 소숫점 이하 3자리까지 구하여라. 
# 귀무가설과 대립가설중 0.05 유의수준에서 유의한 가설을 출력하라
print(round(p, 3))
print('대립 채택')

0.038

### 어느 대학교의 신입생의 학과별 성별에 대한 데이터이다
#### 이 데이터를 바탕으로, 학생들의 학과와 성별이 서로 독립적인지 여부를 확인하기 위해 카이제곱 독립성 검정을 실시 하려한다.

In [35]:
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv')
df.head()

         학번     학과 성별
0  DFSKJK_1   경영학과  여
1  DFSKJK_2   사회학과  여
2  DFSKJK_3  기계공학과  여
3  DFSKJK_4   경제학과  남
4  DFSKJK_5  기계공학과  여

In [37]:
df.shape

(1022, 3)

In [38]:
df.isna().sum()

학번    0
학과    0
성별    0
dtype: int64

In [39]:
# 학과 평균 인원에 대한 값을 소숫점 이하 3자리까지 구하여라
df.학과.unique()

array(['경영학과', '사회학과', '기계공학과', '경제학과', '전자공학과', '의학과'], dtype=object)

In [44]:
mn = round(df.groupby('학과').size().mean(), 3)
print(mn)

170.333

In [46]:
# 카이제곱검정 독립성 검정 통계량을 소숫점 이하 3자리까지 구하여라
df.head()

         학번     학과 성별
0  DFSKJK_1   경영학과  여
1  DFSKJK_2   사회학과  여
2  DFSKJK_3  기계공학과  여
3  DFSKJK_4   경제학과  남
4  DFSKJK_5  기계공학과  여

In [48]:
df_tmp = pd.crosstab(df.학과, df.성별)
df_tmp

성별       남    여
학과
경영학과   150  171
경제학과    79   91
기계공학과  125  119
사회학과    48   51
의학과     32   27
전자공학과   74   55

In [51]:
from scipy.stats import chi2_contingency
chi2, p, dof, expected = chi2_contingency(df_tmp)
print(round(chi2, 3))

5.646

In [54]:
# 카이제곱검정 독립성 검정의 pvalue를 소숫점 이하 3자리까지 구하여라.
# 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 것을 출력하라
print(round(p, 3))
print('귀무가설')

0.342
귀무가설

#### 어느 학교에서 수학 시험을 본 학생 100명 중 60명이 60점 이상을 받았다.
#### 이 학교의 수학 시험의 평균 점수가 50점 이상인지 95%의 신뢰 수준에서 검정하려한다.

In [58]:
# 검정 통계량을 소숫점 이하 3자리에서 구하시오

n = 100
p_hat = 0.6
p = 0.5
alpha = 0.05

# 검정통계량 계산
z = round((p_hat - p) / np.sqrt(p * (1-p)/n), 3)
print(z)

2.0

In [61]:
# pvalue를 소숫점 이하 3자리까지 구하고 귀무가설과 대립가설중 유의한 것을 출력하라
from scipy.stats import norm

print(round(1 - norm.cdf(z), 3))
print('대립')

0.023
대립

### 다이어트약의 전후 체중 변화 기록이다
##### 투약 후 체중에서 투약 전 체중을 뺏을 때 값은 일반 적으로 세가지 등급으로 나눈다. -3이하 : A등급, -3초과 0이하 : B등급, 0 초과 : C등급. 약 실험에서 A,B,C 그룹간의 인원 수 비율은 2:1:1로 알려져 있다. 위 데이터 표본은 각 범주의 비율에 적합한지 카이제곱 검정하려한다.

In [62]:
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_1.csv')
df.head()

       ID     투약전     투약후
0  user_1  55.137  56.106
1  user_2  66.584  60.409
2  user_3  52.259  50.639
3  user_4  77.081  69.164
4  user_5  62.677  57.622

In [65]:
df.shape

(235, 3)

In [70]:

def chg_group(x):
    if x <= -3:
        return 'A'
    elif -3 < x <= 0:
        return 'B'
    elif x > 0:
        return 'C'
    return

df['cha'] = df.투약후 - df.투약전
df['등급'] = df.cha.apply(chg_group)
df.head()

       ID     투약전     투약후    cha 등급
0  user_1  55.137  56.106  0.969  C
1  user_2  66.584  60.409 -6.175  A
2  user_3  52.259  50.639 -1.620  B
3  user_4  77.081  69.164 -7.917  A
4  user_5  62.677  57.622 -5.055  A

In [77]:
df_tmp = df.groupby('등급').size().to_frame('counts')
df_tmp

    counts
등급
A      121
B       67
C       47

In [74]:
# A등급에 해당하는 유저는 몇명인지 확인하라
len(df[df.등급 == 'A'])

121

In [80]:
# 카이제곱검정 통계량을 반올림하여 소숫점 이하 3째자리까지 구하여라
df_tmp['expected'] = [df_tmp.counts.sum() * (2/4), df_tmp.counts.sum() * (1/4), df_tmp.counts.sum() * (1/4)]
df_tmp

    counts  expected
등급
A      121    117.50
B       67     58.75
C       47     58.75

In [82]:
from scipy.stats import chisquare
s, p = chisquare(df_tmp.counts, df_tmp.expected)
print(round(s, 3))

3.613

In [84]:
# 카이제곱 검정 p값을 반올림하여 소숫점 이하 3자리까지 구하고, 
# 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 가설을 하나를 선택하시오(귀무/대립)
print(round(p, 3))
print('귀무')

0.164
귀무

### 다이어트약의 전후 체중 변화 기록이다. 
#### A,B 공장에서 생산한 기계들의 rpm 값들을 기록한 데이터이다. 대응 표본 t 검정을 통해 B공장 제품들이 A 공장 제품들보다 rpm이 높다고 말할 수 있는지 검정하려한다

In [85]:
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e3_p3_2_.csv')
df.head()

     rpm group
0  163.6     A
1  246.9     A
2  234.9     A
3  156.9     A
4  226.6     A

In [87]:
df.shape

(200, 2)

In [90]:
# A,B 공장 각각 정규성을 가지는지 샤피로 검정을 통해 확인하라. 
# (각 공장의 pvalue 출력할 것)
a = df[df.group == 'A'].rpm
b = df[df.group == 'B'].rpm

from scipy.stats import shapiro
sa = shapiro(a)
sb = shapiro(b)
print('A 공장의 pvalue : ', sa.pvalue)
print('B 공장의 pvalue : ', sb.pvalue)
print('둘 다 정규성을 갖는다.')

ShapiroResult(statistic=0.9863898158073425, pvalue=0.397915244102478)
ShapiroResult(statistic=0.9943947196006775, pvalue=0.9562925100326538)

In [93]:
# A,B 공장 생산 제품의 rpm은 각각 등분산성
# levene 검정을 통해 확인하라. 
from scipy.stats import levene
l_p = levene(a, b, center='median')
print(l_p)
print('등분산성을 갖는다.')

LeveneResult(statistic=0.014634456943777612, pvalue=0.9038351280607142)

In [103]:
# 대응 표본 t 검정을 통해 B공장 제품들의 rpm이 A 공장 제품의 rpm보다 크다고 말할 수 있는지 검정하라. 
# pvalue를 소숫점 이하 3자리까지 출력하고 귀무가설, 대립가설 중 하나를 출력하라*
from scipy.stats import ttest_rel
t_p = ttest_rel(b, a, alternative='greater')
print(t_p)
print(round(t_p.pvalue, 3))
print('대립')

Ttest_relResult(statistic=2.408800138279077, pvalue=0.008927208346711192)
0.009
대립